package net.basov.metro;

import android.content.res.Resources;

/**
 * The MIT License (MIT)

 Copyright (c) 2016 Mikhail Basov

 Permission is hereby granted, free of charge, to any person obtaining a copy
 of this software and associated documentation files (the "Software"), to deal
 in the Software without restriction, including without limitation the rights
 to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 copies of the Software, and to permit persons to whom the Software is
 furnished to do so, subject to the following conditions:

 The above copyright notice and this permission notice shall be included in
 all copies or substantial portions of the Software.

 THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 THE SOFTWARE.


 * Created by mvb on 9/12/16.
 */
public class Stations {
    public static String getStationByStationId(int stationId){
        String desc = "";
        int entrance = stationId%10;
        switch (stationId/10) {


/**
 * [01] Sokolnicheskaya line
 */
            case 1:
                desc += "Бульвар Рокоссовского (Сокольническая)";
                break;
            case 2:
                desc += "Черкизовская (Сокольническая)";
                break;
            case 3:
                desc += "Преображенская площадь (Сокольническая)";
                break;
            case 4:
                desc += "Сокольники (Сокольническая)";
                break;
            case 5:
                desc += "Красносельская (Сокольническая)";
                break;
            case 6:
                desc += "Комсомольская (Сокольническая)";
                break;
            case 7:
                desc += "Красные ворота (Сокольническая)";
                break;
            case 8:
                desc += "Чистые пруды (Сокольническая)";
                break;
            case 9:
                desc += "Лубянка (Сокольническая)";
                break;
            case 10:
                desc += "Охотный ряд (Сокольническая)";
                break;
            case 11:
                desc += "Библиотека им. Ленина (Сокольническая)";
                break;
            case 12:
                desc += "Кропоткинская (Сокольническая)";
                break;
            case 13:
                desc += "Парк культуры (Сокольническая)";
                break;
            case 14:
                desc += "Фрунзенская (Сокольническая)";
                break;
            case 15:
                desc += "Спортивная (Сокольническая)";
                switch (entrance) {
                    case 2: //(0001983509-3d-012)
                        desc += " (южный)";
                        break;
                    default:
                        break;
                }
                break;
            case 16:
                desc += "Воробьёвы горы (Сокольническая)";
                switch (entrance) {
                    case 2: //(2580244002-20-19)
                        desc += " (южный)";
                        break;
                    default:
                        break;
                }
                break;
            case 17:
                desc += "Университет (Сокольническая)";
                break;
            case 18:
                desc += "Проспект Вернадского (Сокольническая)";
                break;
            case 19:
                desc += "Юго-Западная (Сокольническая)";
                switch (entrance) {
                    case 1: //(0001983509-3d-013)
                        desc += " (северный)";
                        break;
                    default:
                        break;
                }
                break;
            case 228:
                desc +=  "Тропарёво";
                switch (entrance) {
                    case 1: //(0001983509-3d-015)
                        desc += " (первый)";
                    case 2: //(0001983509-3d-014)
                        desc += " (второй)";
                        break;
                    default:
                        break;
                }
                break;
            case 20:
                desc += "Красногвардейская (Замоскворецкая)";
                break;
            case 21:
                desc += "Домодедовская (Замоскворецкая)";
                break;
            case 22:
                desc += "Орехово (Замоскворецкая)";
                break;
            case 23:
                desc += "Царицыно (Замоскворецкая)";
                break;
            case 24:
                desc += "Кантемировская (Замоскворецкая)";
                break;
            case 25:
                desc += "Каширская (Замоскворецкая)";
                break;

//TODO: Need to check ststions codes
//            desc += "Каширская (Замоскворецкая)";
//            desc += "Каширская (Каховская)";
/*
            case 25:
                desc += "Каширская (Каховская)";
                break;
*/
            case 26:
                desc += "Каховская (Каховская)";
                break;
            case 27:
                desc += "Варшавская (Каховская)";
                break;
            case 28:
                desc += "Коломенская (Замоскворецкая)";
                break;
            case 29:
                desc += "Автозаводская (Замоскворецкая)";
                break;
            case 30:
                desc += "Павелецкая (Замоскворецкая)";
                break;
            case 31:
                desc += "Новокузнецкая (Замоскворецкая)";
                break;
            case 32:
                desc += "Театральная (Замоскворецкая)";
                break;
            case 33:
                desc += "Тверская (Замоскворецкая)";
                break;
            case 34:
                desc += "Маяковская (Замоскворецкая)";
                break;
            case 35:
                desc += "Белорусская (Замоскворецкая)";
                break;
            case 36:
                desc += "Динамо (Замоскворецкая)";
                break;
            case 37:
                desc += "Аэропорт (Замоскворецкая)";
                break;
            case 38:
                desc += "Сокол (Замоскворецкая)";
                break;
            case 39:
                desc += "Войковская (Замоскворецкая)";
                break;
            case 40:
                desc += "Водный стадион (Замоскворецкая)";
                break;
            case 41:
                desc += "Речной вокзал (Замоскворецкая)";
                break;
            case 42:
                desc += "Киевская (Арбатско-Покровская)";
                break;
            case 43:
                desc += "Смоленская (Арбатско-Покровская)";
                break;
            case 44:
                desc += "Арбатская (Арбатско-Покровская)";
                break;
            case 45:
                desc += "Площадь Революции (Арбатско-Покровская)";
                break;
            case 46:
                desc += "Курская (Арбатско-Покровская)";
                break;
            case 47:
                desc += "Бауманская (Арбатско-Покровская)";
                break;
            case 48:
                desc += "Электрозаводская (Арбатско-Покровская)";
                break;
            case 49:
                desc += "Семеновская (Арбатско-Покровская)";
                break;
            case 50:
                desc += "Партизанская (Арбатско-Покровская)";
                break;
            case 51:
                desc += "Измайловская (Арбатско-Покровская)";
                break;
            case 52:
                desc += "Первомайская (Арбатско-Покровская)";
                break;
            case 53:
                desc += "Щелковская (Арбатско-Покровская)";
                break;
            case 54:
                desc += "Александровский сад (Филевская)";
                break;
            case 55:
                desc += "Арбатская (Филевская)";
                break;
            case 56:
                desc += "Смоленская (Филевская)";
                break;
            case 57:
                desc += "Киевская (Филевская)";
                break;
            case 58:
                desc += "Студенческая (Филевская)";
                break;
            case 59:
                desc += "Кутузовская (Филевская)";
                break;
            case 60:
                desc += "Фили (Филевская)";
                break;
            case 61:
                desc += "Багратионовская (Филевская)";
                break;
            case 62:
                desc += "Филевский парк (Филевская)";
                break;
            case 63:
                desc += "Пионерская (Филевская)";
                break;
            case 64:
                desc += "Кунцевская (Филевская)";
                break;
            case 65:
                desc += "Молодежная (Арбатско-Покровская)";
                break;
            case 66:
                desc += "Крылатское (Арбатско-Покровская)";
                break;
            case 67:
                desc += "Белорусская (Кольцевая)";
                break;
            case 68:
                desc += "Новослободская (Кольцевая)";
                break;
            case 69:
                desc += "Проспект Мира (Кольцевая)";
                break;
            case 70:
                desc += "Комсомольская (Кольцевая)";
                break;
            case 71:
                desc += "Курская (Кольцевая)";
                break;
            case 72:
                desc += "Таганская (Кольцевая)";
                break;
            case 73:
                desc += "Павелецкая (Кольцевая)";
                break;
            case 74:
                desc += "Добрынинская (Кольцевая)";
                break;
            case 75:
                desc += "Октябрьская (Кольцевая)";
                break;
            case 76:
                desc += "Парк культуры (Кольцевая)";
                break;
            case 77:
                desc += "Киевская (Кольцевая)";
                break;
            case 78:
                desc += "Краснопресненская (Кольцевая)";
                break;
/**
 * [08] Kalininskaya line
 */
            case 79:
                desc += "Новогиреево (Калининская)";
                switch (entrance) {
                    case 2: //?(2577405528-60-09)
                        desc += " (?)";
                        break;
                    default:
                        break;
                }
                break;
            case 80:
                desc += "Перово (Калининская)";
                break;
            case 81:
                desc += "Шоссе Энтузиастов (Калининская)";
                break;
            case 82:
                desc += "Авиамоторная (Калининская)";
                break;
            case 83:
                desc += "Площадь Ильича (Калининская)";
                break;
            case 84:
                desc += "Марксистская (Калининская)";
                break;
            case 85:
                desc += "Третьяковская (Калининская)";
                break;
/**
 * [06] Kaluzhsko-Rizhskaya line
 */
            case 86:
                desc += "Медведково (Калужско-Рижская)";
                break;
            case 87:
                desc += "Бабушкинская (Калужско-Рижская)";
                break;
            case 88:
                desc += "Свиблово (Калужско-Рижская)";
                break;
            case 89:
                desc += "Ботанический сад (Калужско-Рижская)";
                break;
            case 90:
                desc += "ВДНХ (Калужско-Рижская)";
                break;
            case 91:
                desc += "Алексеевская (Калужско-Рижская)";
                break;
            case 92:
                desc += "Рижская (Калужско-Рижская)";
                break;
            case 93:
                desc += "Проспект Мира (Калужско-Рижская)";
                break;
            case 94:
                desc += "Сухаревская (Калужско-Рижская)";
                break;
            case 95:
                desc += "Тургеневская (Калужско-Рижская)";
                break;
            case 96:
                desc += "Китай-город (Калужско-Рижская)";
                break;
            case 97:
                desc += "Третьяковская (Калужско-Рижская)";
                break;
            case 98:
                desc += "Октябрьская (Калужско-Рижская)";
                break;
            case 99:
                desc += "Шаболовская (Калужско-Рижская)";
                break;
            case 100:
                desc += "Ленинский проспект (Калужско-Рижская)";
                break;
            case 101:
                desc += "Академическая (Калужско-Рижская)";
                break;
            case 102:
                desc += "Профсоюзная (Калужско-Рижская)";
                break;
            case 103:
                desc += "Новые Черемушки (Калужско-Рижская)";
                break;
            case 104:
                desc += "Калужская (Калужско-Рижская)";
                break;
            case 105:
                desc += "Беляево (Калужско-Рижская)";
                break;
            case 106:
                desc += "Коньково (Калужско-Рижская)";
                switch (entrance) {
                    case 1: //(2580635469-60-02)
                        desc += " (северный)";
                    case 2: //(2580244002-20-18)
                        desc += " (южный)";
                        break;
                    default:
                        break;
                }
                break;
            case 107:
                desc += "Теплый Стан (Калужско-Рижская)";
                break;
            case 108:
                desc += "Ясенево (Калужско-Рижская)";
                break;
            case 109:
                desc += "Новоясеневская (Калужско-Рижская)";
                break;
/**
 * [07] Tagansko-Krasnopresnenskaya line
 */
            case 110:
                desc += "Выхино (Таганско-Краснопресненская)";
                break;
            case 111:
                desc += "Рязанский проспект (Таганско-Краснопресненская)";
                break;
            case 112:
                desc += "Кузьминки (Таганско-Краснопресненская)";
                break;
            case 113:
                desc += "Текстильщики (Таганско-Краснопресненская)";
                break;
            case 114:
                desc += "Волгоградский проспект (Таганско-Краснопресненская)";
                break;
            case 115:
                desc += "Пролетарская (Таганско-Краснопресненская)";
                switch (entrance) {
                    case 1: //(2580244002-20-17)
                        desc += " (западный)";
                    case 2: //(new-2575358437-01-01)
                        desc += " (восточный)";
                        break;
                    default:
                        break;
                }
                break;
            case 116:
                desc += "Таганская (Таганско-Краснопресненская)";
                break;
            case 117:
                desc += "Китай-город (Таганско-Краснопресненская)";
                break;
            case 118:
                desc += "Кузнецкий мост (Таганско-Краснопресненская)";
                break;
            case 119:
                desc += "Пушкинская (Таганско-Краснопресненская)";
                switch (entrance) {
                    case 1: //(0001983509-3d-012)
                        desc += " (к Известиям)";
                        break;
                    default:
                        break;
                }
                break;
            case 120:
                desc += "Баррикадная (Таганско-Краснопресненская)";
                break;
            case 121:
                desc += "Улица 1905 года (Таганско-Краснопресненская)";
                break;
            case 122:
                desc += "Беговая (Таганско-Краснопресненская)";
                switch (entrance) {
                    case 1: //?(2577096376-60-25)
                        desc += " (вход со стороны платформы)";
                        break;
                    default:
                        break;
                }
                break;
            case 123:
                desc += "Полежаевская (Таганско-Краснопресненская)";
                break;
            case 124:
                desc += "Октябрьское поле (Таганско-Краснопресненская)";
                break;
            case 125:
                desc += "Щукинская (Таганско-Краснопресненская)";
                break;
            case 126:
                desc += "Тушинская (Таганско-Краснопресненская)";
                break;
            case 127:
                desc += "Сходненская (Таганско-Краснопресненская)";
                break;
            case 128:
                desc += "Планерная (Таганско-Краснопресненская)";
                break;
            case 129:
                desc += "Алтуфьево (Серпуховско-Тимирязевская)";
                break;
            case 130:
                desc += "Бибирево (Серпуховско-Тимирязевская)";
                break;
            case 131:
                desc += "Отрадное (Серпуховско-Тимирязевская)";
                break;
            case 132:
                desc += "Владыкино (Серпуховско-Тимирязевская)";
                break;
            case 133:
                desc += "Петровско-Разумовская (Серпуховско-Тимирязевская)";
                break;
            case 134:
                desc += "Тимирязевская (Серпуховско-Тимирязевская)";
                break;
            case 135:
                desc += "Дмитровская (Серпуховско-Тимирязевская)";
                break;
            case 136:
                desc += "Савеловская (Серпуховско-Тимирязевская)";
                break;
            case 137:
                desc += "Менделеевская (Серпуховско-Тимирязевская)";
                break;
            case 138:
                desc += "Цветной бульвар (Серпуховско-Тимирязевская)";
                break;
            case 139:
                desc += "Чеховская (Серпуховско-Тимирязевская)";
                break;
            case 140:
                desc += "Боровицкая (Серпуховско-Тимирязевская)";
                break;
            case 141:
                desc += "Полянка (Серпуховско-Тимирязевская)";
                break;
            case 142:
                desc += "Серпуховская (Серпуховско-Тимирязевская)";
                break;
            case 143:
                desc += "Тульская (Серпуховско-Тимирязевская)";
                break;
            case 144:
                desc += "Нагатинская (Серпуховско-Тимирязевская)";
                break;
            case 145:
                desc += "Нагорная (Серпуховско-Тимирязевская)";
                break;
            case 146:
                desc += "Нахимовский проспект (Серпуховско-Тимирязевская)";
                break;
            case 147:
                desc += "Севастопольская (Серпуховско-Тимирязевская)";
                break;
            case 148:
                desc += "Чертановская (Серпуховско-Тимирязевская)";
                break;
            case 149:
                desc += "Южная (Серпуховско-Тимирязевская)";
                break;
            case 150:
                desc += "Пражская (Серпуховско-Тимирязевская)";
                break;
/**
 * [10]Lublinsko-Dmitrovskaya line
 */
            case 151:
                desc += "Чкаловская (Люблинско-Дмитровская)";
                break;
            case 152:
                desc += "Римская (Люблинско-Дмитровская)";
                break;
            case 153: //(2580244002-20-16) (single entrance)
                desc += "Крестьянская застава (Люблинско-Дмитровская)";
                break;
            case 154:
                desc += "Кожуховская (Люблинско-Дмитровская)";
                break;
            case 155:
                desc += "Печатники (Люблинско-Дмитровская)";
                break;
            case 156:
                desc += "Волжская (Люблинско-Дмитровская)";
                break;
            case 157:
                desc += "Люблино (Люблинско-Дмитровская)";
                break;
            case 158:
                desc += "Братиславская (Люблинско-Дмитровская)";
                break;
            case 159:
                desc += "Марьино (Люблинско-Дмитровская)";
                break;
            case 161:
                desc += "Дубровка (Люблинско-Дмитровская)";
                break;
            case 162:
                desc += "Улица Академика Янгеля (Серпуховско-Тимирязевская)";
                break;
            case 163:
                desc += "Аннино (Серпуховско-Тимирязевская)";
                break;
            case 164:
                desc += "Бульвар Дмитрия Донского (Серпуховско-Тимирязевская)";
                break;
            case 165:
                desc += "Парк Победы (Арбатско-Покровская)";
                break;
//TODO: Need to check ststions codes
//            desc += "Парк Победы (Арбатско-Покровская)";
//            desc += "Парк Победы (Калининская)";
/*
            case 165:
                desc += "Парк Победы (Калининская)";
                break;
*/
            case 166:
                desc += "Трубная (Люблинско-Дмитровская)";
                break;
            case 186:
                desc += "Новокосино (Калининская)";
                break;
            case 188:
                desc += "Выставочная (Филевская)";
                break;
            case 189:
                desc += "Международная (Филевская)";
                break;
            case 191:
                desc += "Улица Старокачаловская (Бутовская)";
                break;
            case 192:
                desc += "Улица Скобелевская (Бутовская)";
                break;
            case 193:
                desc += "Бульвар адмирала Ушакова (Бутовская)";
                break;
            case 194:
                desc += "Улица Горчакова (Бутовская)";
                break;
            case 195:
                desc += "Бунинская аллея (Бутовская)";
                break;
            case 210:
                desc += "Кунцевская (Арбатско-Покровская)";
                break;
            case 211:
                desc += "Строгино (Арбатско-Покровская)";
                break;

            default:
                break;
        }
        return desc;
    }
}

/**
 * Information about station codes from very old, magnetic metro tickets
 * Source of information: http://www.metro.ru/stations/codes/
 *
 Станция	Линия	Код станции

 Бульвар Рокоссовского	Сокольническая	001
 Черкизовская	Сокольническая	002
 Преображенская площадь	Сокольническая	003
 Сокольники	Сокольническая	004
 Красносельская	Сокольническая	005
 Комсомольская	Сокольническая	006
 Красные ворота	Сокольническая	007
 Чистые пруды	Сокольническая	008
 Лубянка	Сокольническая	009
 Охотный ряд	Сокольническая	010
 Библиотека им. Ленина	Сокольническая	011
 Кропоткинская	Сокольническая	012
 Парк культуры	Сокольническая	013
 Фрунзенская	Сокольническая	014
 Спортивная	Сокольническая	015
 Воробьёвы горы	Сокольническая	016
 Университет	Сокольническая	017
 Проспект Вернадского	Сокольническая	018
 Юго-Западная	Сокольническая	019
 Красногвардейская	Замоскворецкая	020
 Домодедовская	Замоскворецкая	021
 Орехово	Замоскворецкая	022
 Царицыно	Замоскворецкая	023
 Кантемировская	Замоскворецкая	024
 Каширская	Замоскворецкая	025
 Каширская	Каховская	025
 Каховская	Каховская	026
 Варшавская	Каховская	027
 Коломенская	Замоскворецкая	028
 Автозаводская	Замоскворецкая	029
 Павелецкая	Замоскворецкая	030
 Новокузнецкая	Замоскворецкая	031
 Театральная	Замоскворецкая	032
 Тверская	Замоскворецкая	033
 Маяковская	Замоскворецкая	034
 Белорусская	Замоскворецкая	035
 Динамо	Замоскворецкая	036
 Аэропорт	Замоскворецкая	037
 Сокол	Замоскворецкая	038
 Войковская	Замоскворецкая	039
 Водный стадион	Замоскворецкая	040
 Речной вокзал	Замоскворецкая	041
 Киевская	Арбатско-Покровская	042
 Смоленская	Арбатско-Покровская	043
 Арбатская	Арбатско-Покровская	044
 Площадь Революции	Арбатско-Покровская	045
 Курская	Арбатско-Покровская	046
 Бауманская	Арбатско-Покровская	047
 Электрозаводская	Арбатско-Покровская	048
 Семеновская	Арбатско-Покровская	049
 Партизанская	Арбатско-Покровская	050
 Измайловская	Арбатско-Покровская	051
 Первомайская	Арбатско-Покровская	052
 Щелковская	Арбатско-Покровская	053
 Александровский сад	Филевская	054
 Арбатская	Филевская	055
 Смоленская	Филевская	056
 Киевская	Филевская	057
 Студенческая	Филевская	058
 Кутузовская	Филевская	059
 Фили	Филевская	060
 Багратионовская	Филевская	061
 Филевский парк	Филевская	062
 Пионерская	Филевская	063
 Кунцевская	Филевская	064
 Молодежная	Арбатско-Покровская	065
 Крылатское	Арбатско-Покровская	066
 Белорусская	Кольцевая	067
 Новослободская	Кольцевая	068
 Проспект Мира	Кольцевая	069
 Комсомольская	Кольцевая	070
 Курская	Кольцевая	071
 Таганская	Кольцевая	072
 Павелецкая	Кольцевая	073
 Добрынинская	Кольцевая	074
 Октябрьская	Кольцевая	075
 Парк культуры	Кольцевая	076
 Киевская	Кольцевая	077
 Краснопресненская	Кольцевая	078
 Новогиреево	Калининская	079
 Перово	Калининская	080
 Шоссе Энтузиастов	Калининская	081
 Авиамоторная	Калининская	082
 Площадь Ильича	Калининская	083
 Марксистская	Калининская	084
 Третьяковская	Калининская	085
 Медведково	Калужско-Рижская	086
 Бабушкинская	Калужско-Рижская	087
 Свиблово	Калужско-Рижская	088
 Ботанический сад	Калужско-Рижская	089
 ВДНХ	Калужско-Рижская	090
 Алексеевская	Калужско-Рижская	091
 Рижская	Калужско-Рижская	092
 Проспект Мира	Калужско-Рижская	093
 Сухаревская	Калужско-Рижская	094
 Тургеневская	Калужско-Рижская	095
 Китай-город	Калужско-Рижская	096
 Третьяковская	Калужско-Рижская	097
 Октябрьская	Калужско-Рижская	098
 Шаболовская	Калужско-Рижская	099
 Ленинский проспект	Калужско-Рижская	100
 Академическая	Калужско-Рижская	101
 Профсоюзная	Калужско-Рижская	102
 Новые Черемушки	Калужско-Рижская	103
 Калужская	Калужско-Рижская	104
 Беляево	Калужско-Рижская	105
 Коньково	Калужско-Рижская	106
 Теплый Стан	Калужско-Рижская	107
 Ясенево	Калужско-Рижская	108
 Новоясеневская	Калужско-Рижская	109
 Выхино	Таганско-Краснопресненская	110
 Рязанский проспект	Таганско-Краснопресненская	111
 Кузьминки	Таганско-Краснопресненская	112
 Текстильщики	Таганско-Краснопресненская	113
 Волгоградский проспект	Таганско-Краснопресненская	114
 Пролетарская	Таганско-Краснопресненская	115
 Таганская	Таганско-Краснопресненская	116
 Китай-город	Таганско-Краснопресненская	117
 Кузнецкий мост	Таганско-Краснопресненская	118
 Пушкинская	Таганско-Краснопресненская	119
 Баррикадная	Таганско-Краснопресненская	120
 Улица 1905 года	Таганско-Краснопресненская	121
 Беговая	Таганско-Краснопресненская	122
 Полежаевская	Таганско-Краснопресненская	123
 Октябрьское поле	Таганско-Краснопресненская	124
 Щукинская	Таганско-Краснопресненская	125
 Тушинская	Таганско-Краснопресненская	126
 Сходненская	Таганско-Краснопресненская	127
 Планерная	Таганско-Краснопресненская	128
 Алтуфьево	Серпуховско-Тимирязевская	129
 Бибирево	Серпуховско-Тимирязевская	130
 Отрадное	Серпуховско-Тимирязевская	131
 Владыкино	Серпуховско-Тимирязевская	132
 Петровско-Разумовская	Серпуховско-Тимирязевская	133
 Тимирязевская	Серпуховско-Тимирязевская	134
 Дмитровская	Серпуховско-Тимирязевская	135
 Савеловская	Серпуховско-Тимирязевская	136
 Менделеевская	Серпуховско-Тимирязевская	137
 Цветной бульвар	Серпуховско-Тимирязевская	138
 Чеховская	Серпуховско-Тимирязевская	139
 Боровицкая	Серпуховско-Тимирязевская	140
 Полянка	Серпуховско-Тимирязевская	141
 Серпуховская	Серпуховско-Тимирязевская	142
 Тульская	Серпуховско-Тимирязевская	143
 Нагатинская	Серпуховско-Тимирязевская	144
 Нагорная	Серпуховско-Тимирязевская	145
 Нахимовский проспект	Серпуховско-Тимирязевская	146
 Севастопольская	Серпуховско-Тимирязевская	147
 Чертановская	Серпуховско-Тимирязевская	148
 Южная	Серпуховско-Тимирязевская	149
 Пражская	Серпуховско-Тимирязевская	150
 Чкаловская	Люблинско-Дмитровская	151
 Римская	Люблинско-Дмитровская	152
 Крестьянская застава	Люблинско-Дмитровская	153
 Кожуховская	Люблинско-Дмитровская	154
 Печатники	Люблинско-Дмитровская	155
 Волжская	Люблинско-Дмитровская	156
 Люблино	Люблинско-Дмитровская	157
 Братиславская	Люблинско-Дмитровская	158
 Марьино	Люблинско-Дмитровская	159
 Дубровка	Люблинско-Дмитровская	161
 Улица Академика Янгеля	Серпуховско-Тимирязевская	162
 Аннино	Серпуховско-Тимирязевская	163
 Бульвар Дмитрия Донского	Серпуховско-Тимирязевская	164
 Парк Победы	Арбатско-Покровская	165
 Парк Победы	Калининская	165
 Трубная	Люблинско-Дмитровская	166
 Новокосино	Калининская	186
 Выставочная	Филевская	188
 Международная	Филевская	189
 Улица Старокачаловская	Бутовская	191
 Улица Скобелевская	Бутовская	192
 Бульвар адмирала Ушакова	Бутовская	193
 Улица Горчакова	Бутовская	194
 Бунинская аллея	Бутовская	195
 Кунцевская	Арбатско-Покровская	210
 Строгино	Арбатско-Покровская	211

 */

