package net.basov.metro;

import android.content.res.Resources;

/**
 * The MIT License (MIT)

 Copyright (c) 2016 Mikhail Basov

 Permission is hereby granted, free of charge, to any person obtaining a copy
 of this software and associated documentation files (the "Software"), to deal
 in the Software without restriction, including without limitation the rights
 to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 copies of the Software, and to permit persons to whom the Software is
 furnished to do so, subject to the following conditions:

 The above copyright notice and this permission notice shall be included in
 all copies or substantial portions of the Software.

 THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 THE SOFTWARE.


 * Created by mvb on 9/12/16.
 */
public class Stations {
    public static String getStationByStationId(int stationId){
        String desc = "";
        int entrance = stationId%10;
        switch (stationId/10) {

/**
 * [01] Sokolnicheskaya line
 */
            case 15:
                desc += "Спортивная";
                switch (entrance) {
                    case 2: //(0001983509-3d-012)
                        desc += " (южный)";
                        break;
                    default:
                        break;
                }
                break;
            case 162:
                desc +=  "Воробьёвы горы";
                switch (entrance) {
                    case 2: //(2580244002-20-19)
                        desc += " (южный)";
                        break;
                    default:
                        break;
                }
                break;
            case 19:
                desc +=  "Юго-Западная (северный)";
                switch (entrance) {
                    case 1: //(0001983509-3d-013)
                        desc += " (северный)";
                        break;
                    default:
                        break;
                }
                break;
            case 228:
                desc +=  "Тропарёво";
                switch (entrance) {
                    case 1: //(0001983509-3d-015)
                        desc += " (первый)";
                    case 2: //(0001983509-3d-014)
                        desc += " (второй)";
                        break;
                    default:
                        break;
                }
                break;

/**
 * [06] Kaluzhsko-Rizhskaya line
 */
            case 106:
                desc +=  "Коньково";
                switch (entrance) {
                    case 1: //(2580635469-60-02)
                        desc += " (северный)";
                    case 2: //(2580244002-20-18)
                        desc += " (южный)";
                        break;
                    default:
                        break;
                }
                break;

/**
 * [07] Tagansko-Krasnopresnenskaya line
 */
            case 115:
                desc +=  "Пролетарская";
                switch (entrance) {
                    case 1: //(2580244002-20-17)
                        desc += " (западный)";
                    case 2: //(new-2575358437-01-01)
                        desc += " (восточный)";
                        break;
                    default:
                        break;
                }
            case 119:
                desc +=  "Пушкинская";
                switch (entrance) {
                    case 1: //(0001983509-3d-012)
                        desc += " (к Известиям)";
                        break;
                    default:
                        break;
                }
                break;
            case 122:
                desc +=  "Беговая";
                switch (entrance) {
                    case 1: //?(2577096376-60-25)
                        desc += " (вход со стороны платформы)";
                        break;
                    default:
                        break;
                }

/**
 * [08] Kalininskaya line
 */
            case 79:
                desc +=  "Новогиреево(?)";
                switch (entrance) {
                    case 2: //?(2577405528-60-09)
                        desc += " (?)";
                        break;
                    default:
                        break;
                }

/**
 * [10]Lublinsko-Dmitrovskaya line
 */
            case 153: //(2580244002-20-16)
                desc +=  "Крестьянская застава";
                break;
            default:
                break;
        }
        return desc;
    }
}

/**
 * Information about station codes from very old, magnetic metro tickets
 * Source of information: http://www.metro.ru/stations/codes/
 *
 Станция	Линия	Код станции

 Бульвар Рокоссовского	Сокольническая	001
 Черкизовская	Сокольническая	002
 Преображенская площадь	Сокольническая	003
 Сокольники	Сокольническая	004
 Красносельская	Сокольническая	005
 Комсомольская	Сокольническая	006
 Красные ворота	Сокольническая	007
 Чистые пруды	Сокольническая	008
 Лубянка	Сокольническая	009
 Охотный ряд	Сокольническая	010
 Библиотека им. Ленина	Сокольническая	011
 Кропоткинская	Сокольническая	012
 Парк культуры	Сокольническая	013
 Фрунзенская	Сокольническая	014
 Спортивная	Сокольническая	015
 Воробьёвы горы	Сокольническая	016
 Университет	Сокольническая	017
 Проспект Вернадского	Сокольническая	018
 Юго-Западная	Сокольническая	019
 Красногвардейская	Замоскворецкая	020
 Домодедовская	Замоскворецкая	021
 Орехово	Замоскворецкая	022
 Царицыно	Замоскворецкая	023
 Кантемировская	Замоскворецкая	024
 Каширская	Замоскворецкая	025
 Каширская	Каховская	025
 Каховская	Каховская	026
 Варшавская	Каховская	027
 Коломенская	Замоскворецкая	028
 Автозаводская	Замоскворецкая	029
 Павелецкая	Замоскворецкая	030
 Новокузнецкая	Замоскворецкая	031
 Театральная	Замоскворецкая	032
 Тверская	Замоскворецкая	033
 Маяковская	Замоскворецкая	034
 Белорусская	Замоскворецкая	035
 Динамо	Замоскворецкая	036
 Аэропорт	Замоскворецкая	037
 Сокол	Замоскворецкая	038
 Войковская	Замоскворецкая	039
 Водный стадион	Замоскворецкая	040
 Речной вокзал	Замоскворецкая	041
 Киевская	Арбатско-Покровская	042
 Смоленская	Арбатско-Покровская	043
 Арбатская	Арбатско-Покровская	044
 Площадь Революции	Арбатско-Покровская	045
 Курская	Арбатско-Покровская	046
 Бауманская	Арбатско-Покровская	047
 Электрозаводская	Арбатско-Покровская	048
 Семеновская	Арбатско-Покровская	049
 Партизанская	Арбатско-Покровская	050
 Измайловская	Арбатско-Покровская	051
 Первомайская	Арбатско-Покровская	052
 Щелковская	Арбатско-Покровская	053
 Александровский сад	Филевская	054
 Арбатская	Филевская	055
 Смоленская	Филевская	056
 Киевская	Филевская	057
 Студенческая	Филевская	058
 Кутузовская	Филевская	059
 Фили	Филевская	060
 Багратионовская	Филевская	061
 Филевский парк	Филевская	062
 Пионерская	Филевская	063
 Кунцевская	Филевская	064
 Молодежная	Арбатско-Покровская	065
 Крылатское	Арбатско-Покровская	066
 Белорусская	Кольцевая	067
 Новослободская	Кольцевая	068
 Проспект Мира	Кольцевая	069
 Комсомольская	Кольцевая	070
 Курская	Кольцевая	071
 Таганская	Кольцевая	072
 Павелецкая	Кольцевая	073
 Добрынинская	Кольцевая	074
 Октябрьская	Кольцевая	075
 Парк культуры	Кольцевая	076
 Киевская	Кольцевая	077
 Краснопресненская	Кольцевая	078
 Новогиреево	Калининская	079
 Перово	Калининская	080
 Шоссе Энтузиастов	Калининская	081
 Авиамоторная	Калининская	082
 Площадь Ильича	Калининская	083
 Марксистская	Калининская	084
 Третьяковская	Калининская	085
 Медведково	Калужско-Рижская	086
 Бабушкинская	Калужско-Рижская	087
 Свиблово	Калужско-Рижская	088
 Ботанический сад	Калужско-Рижская	089
 ВДНХ	Калужско-Рижская	090
 Алексеевская	Калужско-Рижская	091
 Рижская	Калужско-Рижская	092
 Проспект Мира	Калужско-Рижская	093
 Сухаревская	Калужско-Рижская	094
 Тургеневская	Калужско-Рижская	095
 Китай-город	Калужско-Рижская	096
 Третьяковская	Калужско-Рижская	097
 Октябрьская	Калужско-Рижская	098
 Шаболовская	Калужско-Рижская	099
 Ленинский проспект	Калужско-Рижская	100
 Академическая	Калужско-Рижская	101
 Профсоюзная	Калужско-Рижская	102
 Новые Черемушки	Калужско-Рижская	103
 Калужская	Калужско-Рижская	104
 Беляево	Калужско-Рижская	105
 Коньково	Калужско-Рижская	106
 Теплый Стан	Калужско-Рижская	107
 Ясенево	Калужско-Рижская	108
 Новоясеневская	Калужско-Рижская	109
 Выхино	Таганско-Краснопресненская	110
 Рязанский проспект	Таганско-Краснопресненская	111
 Кузьминки	Таганско-Краснопресненская	112
 Текстильщики	Таганско-Краснопресненская	113
 Волгоградский проспект	Таганско-Краснопресненская	114
 Пролетарская	Таганско-Краснопресненская	115
 Таганская	Таганско-Краснопресненская	116
 Китай-город	Таганско-Краснопресненская	117
 Кузнецкий мост	Таганско-Краснопресненская	118
 Пушкинская	Таганско-Краснопресненская	119
 Баррикадная	Таганско-Краснопресненская	120
 Улица 1905 года	Таганско-Краснопресненская	121
 Беговая	Таганско-Краснопресненская	122
 Полежаевская	Таганско-Краснопресненская	123
 Октябрьское поле	Таганско-Краснопресненская	124
 Щукинская	Таганско-Краснопресненская	125
 Тушинская	Таганско-Краснопресненская	126
 Сходненская	Таганско-Краснопресненская	127
 Планерная	Таганско-Краснопресненская	128
 Алтуфьево	Серпуховско-Тимирязевская	129
 Бибирево	Серпуховско-Тимирязевская	130
 Отрадное	Серпуховско-Тимирязевская	131
 Владыкино	Серпуховско-Тимирязевская	132
 Петровско-Разумовская	Серпуховско-Тимирязевская	133
 Тимирязевская	Серпуховско-Тимирязевская	134
 Дмитровская	Серпуховско-Тимирязевская	135
 Савеловская	Серпуховско-Тимирязевская	136
 Менделеевская	Серпуховско-Тимирязевская	137
 Цветной бульвар	Серпуховско-Тимирязевская	138
 Чеховская	Серпуховско-Тимирязевская	139
 Боровицкая	Серпуховско-Тимирязевская	140
 Полянка	Серпуховско-Тимирязевская	141
 Серпуховская	Серпуховско-Тимирязевская	142
 Тульская	Серпуховско-Тимирязевская	143
 Нагатинская	Серпуховско-Тимирязевская	144
 Нагорная	Серпуховско-Тимирязевская	145
 Нахимовский проспект	Серпуховско-Тимирязевская	146
 Севастопольская	Серпуховско-Тимирязевская	147
 Чертановская	Серпуховско-Тимирязевская	148
 Южная	Серпуховско-Тимирязевская	149
 Пражская	Серпуховско-Тимирязевская	150
 Чкаловская	Люблинско-Дмитровская	151
 Римская	Люблинско-Дмитровская	152
 Крестьянская застава	Люблинско-Дмитровская	153
 Кожуховская	Люблинско-Дмитровская	154
 Печатники	Люблинско-Дмитровская	155
 Волжская	Люблинско-Дмитровская	156
 Люблино	Люблинско-Дмитровская	157
 Братиславская	Люблинско-Дмитровская	158
 Марьино	Люблинско-Дмитровская	159
 Дубровка	Люблинско-Дмитровская	161
 Улица Академика Янгеля	Серпуховско-Тимирязевская	162
 Аннино	Серпуховско-Тимирязевская	163
 Бульвар Дмитрия Донского	Серпуховско-Тимирязевская	164
 Парк Победы	Арбатско-Покровская	165
 Парк Победы	Калининская	165
 Трубная	Люблинско-Дмитровская	166
 Новокосино	Калининская	186
 Выставочная	Филевская	188
 Международная	Филевская	189
 Улица Старокачаловская	Бутовская	191
 Улица Скобелевская	Бутовская	192
 Бульвар адмирала Ушакова	Бутовская	193
 Улица Горчакова	Бутовская	194
 Бунинская аллея	Бутовская	195
 Кунцевская	Арбатско-Покровская	210
 Строгино	Арбатско-Покровская	211

 */

